Revit 2026 API

# ElectricalEquipmentDistributionSystem Property

---

get or set the Distribution System for the Electrical Equipment.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DistributionSysType DistributionSystem { get; set; }
```
```vb
Public Property DistributionSystem As DistributionSysType
	Get
	Set
```
```cpp
public:
property DistributionSysType^ DistributionSystem {
	DistributionSysType^ get ();
	void set (DistributionSysType^ value);
}
```
```fsharp
member DistributionSystem : DistributionSysType with get, set
```

#### Property Value

DistributionSysType

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The Distribution System can not be assigned to the Electrical Equipment. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

This property returns a Distribution System which is assigned to the Electrical Equipment. If there are no Distribution System assigned to this Electrical Equipment, this property will be .

#### Reference

ElectricalEquipment Class

Autodesk.Revit.DB.Electrical Namespace